backend/test/loadtest.yml
config:
  payload:
    path: "userdata.csv"
    fields:
      - "userId"
      - "email"
      - "nickname"
      - "password"
      - "confirmPassword"
  target: 'http://localhost:8080'
  phases:
    - duration: 60
      arrivalRate: 5
  http:
    timeout: 60

scenarios:
  - flow:
    - post:
        url: "/users"
        json:
            userId: "{{ userId }}"
            email: "{{ email }}"
            nickname: "{{ nickname }}"
            password: "{{ password }}"
            confirmPassword: "{{ confirmPassword }}"
    - post:
        url: "/users/login"
        json:
            userId: "{{ userId }}"
            password: "{{ password }}"
    - delete:
        url: "/users"
        json:
            confirmMessage: "회원 탈퇴를 희망합니다."